In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv("/Users/ahmedabukar/Downloads/pandas-workout-data/data/olympic_athlete_events.csv", 
                usecols=["Age", "Height", "Team", "Year", "Season", "City", "Sport", "Event", "Medal"], 
                index_col=["Year", "Season", "Sport", "Event"])
df

                                                                     Age  \
Year Season Sport         Event
1992 Summer Basketball    Basketball Men's Basketball               24.0
2012 Summer Judo          Judo Men's Extra-Lightweight              23.0
1920 Summer Football      Football Men's Football                   24.0
1900 Summer Tug-Of-War    Tug-Of-War Men's Tug-Of-War               34.0
1988 Winter Speed Skating Speed Skating Women's 500 metres          21.0
...                                                                  ...
1976 Winter Luge          Luge Mixed (Men)'s Doubles                29.0
2014 Winter Ski Jumping   Ski Jumping Men's Large Hill, Individual  27.0
                          Ski Jumping Men's Large Hill, Team        27.0
1998 Winter Bobsleigh     Bobsleigh Men's Four                      30.0
2002 Winter Bobsleigh     Bobsleigh Men's Four                      34.0

                                                                    Height  \
Year Season Sport         Event
1992 Summer Basketball    Basketball Men's Basketball                180.0
2012 Summer Judo          Judo Men's Extra-Lightweight               170.0
1920 Summer Football      Football Men's Football                      NaN
1900 Summer Tug-Of-War    Tug-Of-War Men's Tug-Of-War                  NaN
1988 Winter Speed Skating Speed Skating Women's 500 metres           185.0
...                                                                    ...
1976 Winter Luge          Luge Mixed (Men)'s Doubles                 179.0
2014 Winter Ski Jumping   Ski Jumping Men's Large Hill, Individual   176.0
                          Ski Jumping Men's Large Hill, Team         176.0
1998 Winter Bobsleigh     Bobsleigh Men's Four                       185.0
2002 Winter Bobsleigh     Bobsleigh Men's Four                       185.0

                                                                              Team  \
Year Season Sport         Event
1992 Summer Basketball    Basketball Men's Basketball                        China
2012 Summer Judo          Judo Men's Extra-Lightweight                       China
1920 Summer Football      Football Men's Football                          Denmark
1900 Summer Tug-Of-War    Tug-Of-War Men's Tug-Of-War               Denmark/Sweden
1988 Winter Speed Skating Speed Skating Women's 500 metres             Netherlands
...                                                                            ...
1976 Winter Luge          Luge Mixed (Men)'s Doubles                      Poland-1
2014 Winter Ski Jumping   Ski Jumping Men's Large Hill, Individual          Poland
                          Ski Jumping Men's Large Hill, Team                Poland
1998 Winter Bobsleigh     Bobsleigh Men's Four                              Poland
2002 Winter Bobsleigh     Bobsleigh Men's Four                              Poland

                                                                              City  \
Year Season Sport         Event
1992 Summer Basketball    Basketball Men's Basketball                    Barcelona
2012 Summer Judo          Judo Men's Extra-Lightweight                      London
1920 Summer Football      Football Men's Football                        Antwerpen
1900 Summer Tug-Of-War    Tug-Of-War Men's Tug-Of-War                        Paris
1988 Winter Speed Skating Speed Skating Women's 500 metres                 Calgary
...                                                                            ...
1976 Winter Luge          Luge Mixed (Men)'s Doubles                     Innsbruck
2014 Winter Ski Jumping   Ski Jumping Men's Large Hill, Individual           Sochi
                          Ski Jumping Men's Large Hill, Team                 Sochi
1998 Winter Bobsleigh     Bobsleigh Men's Four                              Nagano
2002 Winter Bobsleigh     Bobsleigh Men's Four                      Salt Lake City

                                                                   Medal
Year Season Sport         Event
1992 Summer Basketball    Basketball Men's Basketball                NaN
2012 Summer Judo          Judo Men's Extra-Lightweight               NaN
1920 Summer Football      Football Men's Football                    NaN
1900 Summer Tug-Of-War    Tug-Of-War Men's Tug-Of-War               Gold
1988 Winter Speed Skating Speed Skating Women's 500 metres           NaN
...                                                                  ...
1976 Winter Luge          Luge Mixed (Men)'s Doubles                 NaN
2014 Winter Ski Jumping   Ski Jumping Men's Large Hill, Individual   NaN
                          Ski Jumping Men's Large Hill, Team         NaN
1998 Winter Bobsleigh     Bobsleigh Men's Four                       NaN
2002 Winter Bobsleigh     Bobsleigh Men's Four                       NaN

[271116 rows x 5 columns]

In [3]:
#what is average the age of winning athletes in summer games held between 1936 to 2000? 
(df.sort_index().loc[(slice(1936, 2000), "Summer"), "Age"].mean())

25.026883940421765

In [4]:
#what team has won the most medals in all achery events?
df = df.sort_index()
(df.dropna(subset="Medal").loc[(slice(None), slice(None), "Archery"), ["Team"]].value_counts())

Team
South Korea           69
Belgium               52
France                48
United States         41
China                 19
Italy                 15
Great Britain         13
Chinese Taipei         9
Netherlands            9
Ukraine                8
Cincinnati Archers     8
Soviet Union           7
Japan                  7
Germany                7
Finland                6
Australia              5
Poland                 4
Potomac Archers        4
Russia                 4
Boston Archers         4
Unified Team           4
Indonesia              3
Spain                  3
Mexico                 2
Sweden                 2
Name: count, dtype: int64

In [5]:
df.groupby("Team")["Medal"].count().sort_values()

Team
30. Februar         0
Mystery             0
Mythilus            0
Naiad               0
Nan-2               0
                 ...
France           1550
Great Britain    1673
Germany          1984
Soviet Union     2451
United States    5219
Name: Medal, Length: 1184, dtype: int64

In [12]:
#starting in 1980, what is the average height of "Table Tennis Women's Team"?
df.loc[(slice(1980, 2016), "Summer", slice(None), "Table Tennis Women's Team"), "Height"].mean()

165.04827586206898

In [19]:
#how tall was the tallest tennis player in olympic games from 1980 to 2016?
df.loc[(slice(1980, 2016), slice(None), "Tennis"), "Height"].max()

208.0

In [26]:
df.xs(("Table Tennis Women's Team", "Summer"), level=["Event", "Season"])

                    Age  Height           Team            City   Medal
Year Sport
2008 Table Tennis  26.0   181.0        Croatia         Beijing     NaN
     Table Tennis  21.0   164.0        Germany         Beijing     NaN
     Table Tennis  36.0   171.0        Croatia         Beijing     NaN
     Table Tennis  27.0   158.0    South Korea         Beijing  Bronze
     Table Tennis  20.0   169.0          Spain         Beijing     NaN
...                 ...     ...            ...             ...     ...
2016 Table Tennis  26.0   166.0      Singapore  Rio de Janeiro     NaN
     Table Tennis  20.0   166.0  United States  Rio de Janeiro     NaN
     Table Tennis  25.0   162.0      Australia  Rio de Janeiro     NaN
     Table Tennis  28.0   165.0  United States  Rio de Janeiro     NaN
     Table Tennis  22.0   168.0      Singapore  Rio de Janeiro     NaN

[145 rows x 5 columns]

In [27]:
#remove the season level and then find the height of the tallest tennis player for 1980? 
df = df.reset_index(). set_index(["Year", "Sport", "Event"])

In [30]:
df.xs("Tennis", level="Sport")["Height"].max()

208.0

In [43]:
#in which city were most gold medals awarded from 1980? ... Beijing got 671 gold medals
df_subset = df.loc[1980:2016]
df_subset.loc[df_subset["Medal"] == "Gold", "City"].value_counts()

City
Beijing           671
Rio de Janeiro    665
Athina            664
Sydney            663
London            632
Atlanta           608
Barcelona         559
Seoul             520
Los Angeles       497
Moskva            457
Sochi             202
Torino            176
Vancouver         174
Salt Lake City    162
Nagano            145
Lillehammer       110
Albertville       104
Calgary            87
Sarajevo           74
Lake Placid        72
Name: count, dtype: int64

In [47]:
#how many gold medals were received by the United States from 1980 onward? 
df_subset.loc[df_subset["Medal"] == "Gold", "Team"].value_counts()

Team
United States           1257
Germany                  425
Soviet Union             396
Russia                   365
China                    308
                        ...
United Arab Emirates       1
Israel                     1
Hong Kong                  1
Costa Rica                 1
Puerto Rico                1
Name: count, Length: 132, dtype: int64